tutorials/fluids/hotRoom/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
#runApplication setHotRoom
runApplication soldis4Foam
